[
{"title": ["Tricentennial Resources and Service Opportunities"], "des": ["Celebrating the Big 300th Birthday! \r\nIncarnate Word ministries have been part of almost half of San Antonio’s history. For education and enjoyment during this Tricentennial year, please consider these resources and service opportunities http://www.uiw.edu/eccl/Faculty-Resources/uiw_tricentennial_invitation.html and http://www.uiw.edu/eccl/sustainabilityservice300.html\r\n\"The University of the Incarnate Word provides reasonable accommodation with adequate notice. To request disability accommodation for this event, visit www.uiw.edu/ada.\""], "venue": ["San Antonio, Texas, San Antonio        "], "cost": ["Free"], "time": ["12:00 am - 11:30 pm"], "date": ["\n        Apr 24      "], "cats": [], "dow": [], "address": "San Antonio, Texas"},
{"title": ["Blood Drive"], "des": ["STBTC"], "venue": ["Southern Careers Institute, San Antonio        "], "cost": [], "time": ["8:30 am - 10:00 am"], "date": ["\n        Apr 24      "], "cats": [], "dow": [], "address": "Southern Careers Institute"},
{"title": ["UTSA College of Engineering Tech Symposium"], "des": ["The UTSA College of Engineering Technology Symposium will be held April 24, 2018 in the Convocation Center on Main Campus. This event showcases innovative student projects and research performed across multiple disciplines including engineering, science and business. The symposium is designed to provide a public venue where UTSA senior engineering students to present advances achieved in their design projects to UTSA students, their parents, students around South Texas, industry and government sponsors, and the general public. \r\n\r\nThe Senior Design Projects are the culmination of the engineering undergraduate studies, enabling all engineering students, in their senior year, to apply the knowledge and skills they have accumulated throughout their programs to design, develop, and implement innovative and relevant engineering products. The symposium will not only include work in engineering but also advances achieved in business and science. The event will include exhibitions of Engineering Capstone Projects and the Center for Innovation, Technology and Entrepreneurship $100K Student Technology Venture Competition."], "venue": ["UTSA Main Campus - Convocation Center , San Antonio        "], "cost": ["Free"], "time": ["8:00 am - 2:30 pm"], "date": ["\n        Apr 24      "], "cats": [], "dow": [], "address": "UTSA Main Campus - Convocation Center "},
{"title": ["Blood Drive"], "des": ["STBTC"], "venue": ["Guadalupe Regional Medical Center, Seguin        "], "cost": [], "time": ["8:00 am - 2:00 pm"], "date": ["\n        Apr 25      "], "cats": [], "dow": [], "address": "Guadalupe Regional Medical Center"},
{"title": ["Summer At The Academy"], "des": ["Online registration for Summer At The Academy begins, Monday, March 19, and continues thereafter.  With more than 300 classes offered by more than 70 of the area's top teachers, coaches and artisan, you will find a wide variety of one-of-a-kind academic, sporting, cultural and just fun classes including robotics, legos, art, soccer, drones, minecraft, science, math and much, much more.  The weekly programs for boys and girls ages 4&up run from June 4 to July 27 with morning and afternoon classes plus extended care.  Fees vary, so call or email for information/brochure (210.736.5876; ymcknight@sa-academy.org) or visit our website at www.sa-academy.org."], "venue": ["San Antonio Academy, San Antonio        "], "cost": ["Vary"], "time": ["9:00 am - 12:00 am"], "date": ["\n        Apr 26      "], "cats": [], "dow": [], "address": "San Antonio Academy"},
{"title": ["The Texas Kidney Foundation Spring Symposium"], "des": ["Spring Symposium 2018 provides educational opportunities that enable hospital, dialysis, and transplantation professionals to remain current and knowledgeable about advances in the industry.   Additionally, all educational sessions will be approved for continuing education hours. This year’s topics highlight exciting new discoveries and treatments and care models. Up to 12 CEUs available."], "venue": ["San Antonio Marriot Northwest, San Antonio        "], "cost": ["$85 - $130"], "time": ["7:00 am - 11:30 am"], "date": ["\n        Apr 26      "], "cats": [], "dow": [], "address": "San Antonio Marriot Northwest"},
{"title": ["FREE Tax Help & Preparation For People Who Use American Sign Language"], "des": ["BakerRipley and the Mayor's Office for People with Disabilities are partnering again to provide FREE ASL interpreting tax preparation services! BakerRipley, with the help of Nightingale Interpreting Services, is offering tax preparation and completion services to deaf individuals. Tax services provided by BakerRipley, the Mayor's Office, and Nightingale Interpreting services include tax preparation and completion, ITIN applications and renewals, tax amendments, and more. Individuals and families who earn an annual income of less than $58,000 are eligible to receive these services free of charge and must register for an appointment. Registration is required and interested individuals must secure their appointment with ASL interpreter's availability, all appointments will be done on a first come, first served basis.    \r\n\r\nSince 2009, BakerRipley’s tax centers have prepared over 288,000 tax returns, saving hundreds of dollars for families around the greater Houston area.  With various operating Tax Centers in convenient Houston area locations, BakerRipley is able to provide families and individuals around Houston with quality and reliable tax services that will allow them to keep every cent of their refund.  Families and individuals earning up to $58,000 are able to walk into any of the Tax Center locations for tax preparation at no charge, all year round. \r\n\r\nAppointments for FREE Tax Help & Preparation For People Who Use American Sign Language can be done by emailing Cristina Cave with BakerRipley at ccave@bakerripley.org or by calling the Mayor's Office for People with Disabilities at (832) 394-0814. Individuals must bring a photo ID, social security cards of filer and dependents, ITIN letters, W-2, and other financial documents if applicable. For a list of important documents to bring to the appointment and for more information please visit www.freetaxcenters.org. \r\n"], "venue": ["Neighborhood Centers- Baker Ripley, Houston        "], "cost": ["Free"], "time": ["9:00 am - 5:00 pm"], "date": ["\n        Apr 27      "], "cats": [], "dow": [], "address": "Neighborhood Centers- Baker Ripley"}
]