[
{"priceText": "$25-$30", "title": "Fiesta Pooch Parade", "dateText": "Sat., April 28, 7:45-11 a.m.", "desc": "Presented by the nonprofit Therapy Animals of San Antonio, this 20th annual Fiesta event combines exhibits, presentations, a 2.6-mile walk through the tree-lined streets of Alamo Heights and a canine costume contest.", "sourceLink": "https://www.fiesta-sa.org/events/fiesta-pooch-parade/"},
{"priceText": "Free", "title": "CAM Perennial & International Artist-in-Residence Exhibitions", "dateText": "Wednesdays-Sundays, 12-5 p.m. Continues through May 13", "desc": "In the midst of Contemporary Art Month and San Antonio’s Tricentennial celebrations, Artpace is presenting a cluster of exhibitions that, in certain ways, echo the Alamo City’s history as a “Confluence of Civilizations in the Americas,” a designation presented as the official theme of HemisFair ’68. An annual program that’s successfully built bridges between San Antonio artists and curators from Dallas, Houston, Mexico City, New Orleans and Miami — and also generated significant controversy in 2016 with an all-female show ultimately canceled for its failure to include a Latina artist — the CAM Perennial partners with Artpace this year to welcome Spain into the fold with a group exhibition curated by Canary Islands-based Adonay Bermúdez. A presence in San Antonio since 1731 — when 16 immigrant families arrived here armed with a decree from the King of Spain — Canary Islanders helped establish the first organized civil government in Texas, the villa of San Fernando de Béxar. A socially minded curator who often addresses the “democratization of art” as well as the “disturbances, fears and interests” of contemporary society, Bermúdez paired Canary Islands artists Luna Bengoechea, Francis Naranjo and PSJM (aka Cynthia Viera and Pablo San José) with San Antonio-based Hayfer Brea (born in Caracas, Venezuela), Barbara Miñarro (born in Monterrey, Mexico) and Ethel Shipton (born in Laredo). Following its run in Artpace’s Hudson Showroom, the CAM Perennial will travel to an art space in the Canary Islands. A renowned program that helped place San Antonio’s art scene in a global context, Artpace’s International Artist-in-Residence series welcomes a trio of artists (one from Texas, one from elsewhere in the U.S. and one from abroad) three times each year “to live and create art in San Antonio for two months.” Organized by independent curator and critic Risa Puleo, the Spring 2018 edition comprises site-specific exhibitions created by Carlos Rosales-Silva (Austin), Rafa Esparza (Los Angeles) and Kapwani Kiwanga (Paris). With previous projects exploring colors and forms “that have long been (ab)used to create oppressive stereotypes of Mexican and Indigenous peoples” (Rosales-Silva), colonization and “disrupted genealogies” (Esparza), anthropology, religion and Afrofuturism (Kiwanga), the trio appears bound less by aesthetics than academic research and social concerns. Already on view in Artpace’s street-level Main Space, San Antonio-based Corpus Christi native John Medina’s evolving installation “The Sunset Belongs to Us” reaches its second phase as amplified recordings of participants sharing Alamo City stories get placed in the context of a large-scale drip painting inspired by the San Antonio sunset.", "sourceLink": "http://contemporaryartmonth.com/event/contemporary-art-month-perennial-exhibition-2018/?instance_id=480"},
{"priceText": "$15-$20", "title": "\"Spain to San Antonio: Hispanic Culture on Stage\"", "dateText": "Sundays, 12-5 p.m., Saturdays, 10 a.m.-5 p.m., Thursdays, 10 a.m.-9 p.m. and Tuesdays, Wednesdays, Fridays, 10 a.m.-4 p.m. Continues through June 10", "desc": "To commemorate the 300th anniversary of the McNay’s home city, established as Presidio San Antonio de Bexar in 1718, this exhibition of drawings, prints and costumes explores theater’s fascination with the culture of San Antonio’s Spanish colonial founders.", "sourceLink": "https://www.mcnayart.org/exhibitions/upcoming/spain-to-san-antonio-hispanic-culture-on-stage"},
{"priceText": "$8-$15", "title": "\"Egyptian Animal Mummies: Science Explores an Ancient Religion\"", "dateText": "Tuesdays, Fridays, 10 a.m.-9 p.m. and Wednesdays, Thursdays, Saturdays, Sundays, 10 a.m.-5 p.m. Continues through July 1", "desc": "For the first time, SAMA presents its bronze reliquaries alongside a collection of animal mummies. Recently conserved for this exhibition, the mummies include a cat, three crocodiles, two ibises and three falcons.", "sourceLink": "https://www.samuseum.org/collections/upcoming-exhibitions/1010-animal-mummies"},
{"priceText": "$8-$15", "title": "\"San Antonio 1718: Art from Viceregal Mexico\"", "dateText": "Tuesdays, Fridays, 10 a.m.-9 p.m. and Wednesdays, Thursdays, Saturdays, Sundays, 10 a.m.-5 p.m. Continues through May 13", "desc": "Presented in collaboration with Mexico’s Instituto Nacional de Antropología e Historia (INAH), SAMA’s Tricentennial exhibition “San Antonio 1718: Art from Viceregal Mexico” tells the story of the city’s first century through more than 100 landscapes, portraits, narrative paintings, sculptures, and devotional and decorative objects, many of them never before exhibited in the U.S. The exhibition is organized in three sections: People and Places, The Cycle of Life, and The Church.", "sourceLink": "http://samuseum.org/collections/upcoming-exhibitions/952-san-antonio-1718"},
{"priceText": "Free", "title": "\"Common Currents\" (1968-2017)", "dateText": "Mondays-Fridays, 9 a.m.-6 p.m. and Saturdays, Sundays, 10 a.m.-4 p.m. Continues through May 6", "desc": "In celebration of San Antonio’s seminal Tricentennial year, six downtown artist-centric organizations: Artpace San Antonio, Blue Star Contemporary, Carver Community Cultural Center, The Guadalupe Cultural Arts Center, Mexican Cultural Institute San Antonio, and Southwest School of Art, will partner to present an exhibition that will illuminate the 300 years of their hometown’s history. Common Currents is a diverse, encyclopedic showcase of San Antonio’s history as told and rewritten by more than 300 artists, invited to participate by their peers, and presented over 6 venues. Drawing on the connections or currents that run through San Antonio’s vibrant creative community, each of the organizing partners began by inviting two artists. These initial artists were then asked to invite two peer artists, until more than 300 were amassed. All of the participating artists are assigned one year of San Antonio’s history to reflect on in the development of their work for Common Currents. This exhibition is presented chronologically through a variety of contemporary media across the six venues. The Institute will be highlighting the years 1968-2017.", "sourceLink": "https://www.commoncurrents.org/events"},
{"priceText": "Free", "title": "\"Voz\"", "dateText": "Tuesdays-Sundays, 11 a.m.-6 p.m. Continues through June 10", "desc": "While it’s often applauded for its strong art and art history department, and the steady stream of talented artists that emerge from its programs,\nthe University of Texas at San Antonio also boasts a truly wide-ranging collection of contemporary art that comprises paintings, photographs, sculptures, mixed-media and works on paper. Reflective of both the avid collecting habits of former UTSA President Ricardo Romo and the deep insights of curator Arturo Infante Almeida, the collection is typically displayed in interior and exterior spaces across three campuses but comes to light this month in “Voz,” a sprawling group show on view at Centro de Artes through June 10. Celebrating the collection’s strong focus on Latin@ art to the tune of 222 works by 66 artists, the exhibition comes across as a meticulously organized museum show uniting dozens of familiar names (Ana Fernandez, Alberto Mijangos, Franco Mondini-Ruiz, Richard Armendariz, Anita Valencia and Kathy Vargas among them) with many others well worth discovering. Hovering in Texas but extending far beyond its borders, “Voz” employs both floors of Centro de Artes for an immediately engaging crash course in Latin@ art distinguished by three areas that double as shows within a show: a recreation of UTSA’s “Veinticinco” (a long-running project comprising prints by 25 artists); Cheech Marin’s “The Chicano Collection” (a portfolio of prints by Vincent Valdez, Mel Casas, Alex Rubio, Jesse Treviño and many more); and a thoughtful pairing of images by iconic Mexican photographer Graciela Iturbide and her mentor, Manuel Álvarez Bravo.", "sourceLink": "http://www.getcreativesanantonio.com/Explore-San-Antonio/City-Exhibits/Centro-de-Artes#198431718-events-calendar"},
{"priceText": "Free", "title": "\"Vignettes from San Antonio\"", "dateText": "Tuesdays-Saturdays, 11 a.m.-4 p.m. Continues through May 21", "desc": "When it comes to celebrating and commenting on San Antonio’s present and recent past, artist and printmaker Michael Menchaca is one of our sharpest, most nuanced artistic minds. In this exhibition, Menchaca, who has a special knack for combining the profound with the crude and often juxtaposes images from pop culture with traditional Mesoamerican iconography, offers up large- and small-scale works that speak to San Antonio’s cultural landscape and reference such recognizable landmarks as San Antonio College and Brackenridge Park.", "sourceLink": "http://contemporaryartmonth.com/event/michael-menchaca-vignettes-san-antonio/?instance_id=519"},
{"priceText": "$16.50-$30", "title": "Fiesta Flambeau Parade", "dateText": "Sat., April 28, 6:45-10 p.m.", "desc": "Billed as “America’s largest illuminated night parade,” the Fiesta Flambeau returns to light up Fiesta with a 70th annual event led by mascot Torchy and the the University of Texas Longhorn Band.", "sourceLink": "https://www.fiesta-sa.org/events/fiesta-flambeau-parade/"},
{"priceText": "$12-$15", "title": "King William Fair & Parade", "dateText": "Sat., April 28, 9 a.m.-6 p.m.", "desc": "King William Fair (and the Parade that kicks it off) has been a consistently growing fan favorite Fiesta event since 1968, when it began as a humble, one-block art exhibit. Now the event, the main fundraiser of the King William Association, which seeks to “preserve and protect the oldest historic district in Texas and promote the unique cultural heritage of San Antonio,” attracts tens of thousands of people each year. Its footprint, for one, is positively ideal, sprawling throughout a big slice of the historic neighborhood and running along the banks of the San Antonio River. Its mood, in classic King William style is irreverent, laid-back, artsy and family-friendly. The cold drinks for all ages flow and the food, mostly the typical Fiesta fare, with a few appropriately fancy/quirky add-ons, is abundant. And King William Fair, perhaps more than any other Fiesta event, always has excellent and diverse programming in the entertainment department. Just a few of the performers, musical and otherwise, that you can look forward to at this year’s fair are poet Amanda Flores; magician/ventriloquist The Astonishing Mr. Pitts; Cynergy Dance Company, Guadalupe Dance Company, and Bedouin Dancers; the doggos of the Doggy Fashion Show; and musical acts Volcán, Demitasse, Henry Brun Quartet, Azul Barrientos, Los Nahuatlatos, Los #3 Dinners and the Tubameisters.", "sourceLink": "https://www.fiesta-sa.org/events/king-william-fair/"},
{"priceText": "$7-$10", "title": "\"Pop Up! Fiesta in the Galleries\"", "dateText": "Sundays, 12-5 p.m. and Mondays, Wednesdays-Saturdays, 10 a.m.-5 p.m. Continues through April 29", "desc": "Over-the-top hallmarks of Fiesta, Coronation gowns first stepped into the spotlight during the inaugural Crowning of the Queen of the Order of the Alamo back in 1909. While the Coronation itself remains an elite affair (Wed, Arp. 25 at the Majestic Theatre), the elaborately beaded (and impossibly heavy) gowns and trains can be experienced in a slightly less-imposing atmosphere at the Witte. Switching up the format this year, the museum is scattering its annual exhibition of Coronation gowns into an array of pop-up displays complemented by Fiesta posters through the years.", "sourceLink": "https://www.fiesta-sa.org/events/witte-museum/"},
{"priceText": "Free", "title": "\"Common Currents\" (1768-1817)", "dateText": "Saturdays, Sundays, 10 a.m.-6 p.m. and Thursdays, Fridays, 10 a.m.-8 p.m. Continues through May 7", "desc": "Organized in celebration of San Antonio’s Tricentennial, “Common Currents” is a diverse, encyclopedic showcase of San Antonio’s history as told and rewritten by more than 300 visual and performing artists, invited to participate by their peers, and presented at six venues. Blue Star Contemporary’s portion highlights the years 1768-1817 via works by David Zamora Casas, Ken Little, Pink Leche, Josh Huskin, Tamara Adira, Ruth Buentello, Daniela Cavazos Madrigal, Julia Barbosa Landois, Sarah Fox and more than 40 others.", "sourceLink": "http://bluestarcontemporary.org/exhibitions/common-currents/"},
{"priceText": "$3-$5 (free on First Thursday and First Friday)", "title": "\"Manifest\"", "dateText": "Saturdays, Sundays, 10 a.m.-6 p.m. and Thursdays, Fridays, 10 a.m.-8 p.m. Continues through May 6", "desc": "In “Manifest,” photographer Wendel White gathers nearly 100 remnants from the past documenting the African-American experience in the U.S. Delving as far back as the transatlantic slave trade, the portfolio includes photographic representations of items gathered from private and public collections including slave collars, a drum, a slave bill of sale and, perhaps most strikingly, a preserved lock of Frederick Douglass’ hair. In an artist statement, White explains, “‘Manifest’ is an effort to seek out the artifacts and material evidence of the American construct and representation of race.” Shot against stark, black backgrounds, the images bring to life the ghosts of America’s dark past. A Distinguished Professor of Art at Stockton University, White first exhibited “Manifest” at the California Institute of Integral Studies in San Francisco and has since taken the work throughout the country.", "sourceLink": "http://bluestarcontemporary.org/"},
{"priceText": "Free", "title": "\"The Other Side of the Alamo: Art Against the Myth\"", "dateText": "Saturdays, 11 a.m.-5 p.m. and Mondays-Fridays, 9 a.m.-5 p.m. Continues through July 20", "desc": "Thanks in no small part to a seven-year master plan promising to “Reimagine the Alamo” (via preserving the Alamo Church, removing “entertainment attractions from the battlefield,” closing Alamo Street to vehicle traffic, building a museum and restoring the Alamo Cenotaph), San Antonio’s most iconic destination is a key component of cultural discourse as of late. Within the realm of visual art, the 18th-century mission is often depicted with a curious blend of reverence and humor — such as in Sala Diaz founder Alejandro Diaz’s witty neon sign declaring “I Can’t Remember the Alamo” or Gary Sweeney’s Coming Soon! — a Photoshopped image of the Alamo outfitted with a sign announcing the “Future Home [of] Ripley’s Believe It or Not! Museum.” Made possible by a $30,000 grant from the Andy Warhol Foundation, the Guadalupe Cultural Arts Center’s new group show “The Other Side of the Alamo: Art Against the Myth” continues this creative dialogue while taking aim at the UNESCO-designated World Heritage Site from a distinct perspective. Curated by Ruben C. Cordova, the exhibition tasked more than 20 Chican@ artists with “countering the mainstream myths of the Alamo’s iconic status through their traditional and non-traditional paintings, sculptures, and installation work.” Gathering works from both well-known, established artists and the new vanguard alike (from César Martinez and Jesse Treviño to Mari Hernandez and Kristel Orta-Puente), the show seeks to highlight ways the Alamo has affected people of color by exploring “suppressed narratives” surrounding “the Mexican American War, the annexation of half of Mexico, and the spread of slavery.”", "sourceLink": "http://www.guadalupeculturalarts.org/the-other-side-of-the-alamo-art-against-the-myth/"},
{"priceText": "$5-$10 ($10 surcharge for \"Something to Say\")", "title": "\"Something to Say\"", "dateText": "Thursdays, 10 a.m.-9 p.m., Tuesdays, Wednesdays, Fridays, 10 a.m.-4 p.m., Saturdays, 10 a.m.-5 p.m. and Sundays, 12-5 p.m. Continues through May 6", "desc": "The McNay Art Museum has always housed arguably San Antonio’s finest collection of modern art and attracted damn fine visiting exhibitions to boot. But, over the past year and a half, owing in no small part to the bold, forward-thinking vision and useful connections of new director Richard Aste, the McNay has really been on a roll. Showing no signs of losing momentum, the museum is set to open three compelling new exhibitions on February 8 (all of which will run through\nMay 6). “Something to Say: The McNay Presents 100 Years of African American Art” marks the museum’s first survey of modern and contemporary African-American art. Encouraging a thoughtful consideration of the plurality of African-American experience and expression, the exhibit represents the McNay’s ongoing commitment to “equity, inclusion, and social consciousness as well as artistic excellence.” “30 Americans: Rubell Family Collection” boasts some of the most important African-American artists of the past three decades, including Mark Bradford, Nick Cave, Robert Colescott, Glenn Ligon, Kerry James Marshall, Mickalene Thomas, and Kehinde Wiley (whose recently commissioned presidential portrait of Barack Obama we are dying to see). “Haiti’s Revolution in Art: Jacob Lawrence Toussaint L’Ouverture Series” is a portfolio of stunningly powerful prints from the artist’s 41-panel exploration of the undersung leader of the 18th-century Haitian revolution, which drove out the French colonizers. Lawrence first learned of L’Ouverture while on a quest to discover new African-American heroes, which he felt the history books had done a subpar job of providing him in school.", "sourceLink": "https://www.mcnayart.org/exhibitions/upcoming/something-to-say-the-mcnay-presents-100-years-of-african-american-art"}
]